#Урок 5. Условный оператор. Инструкция if
#1. Напишите программный код, в котором в случае, если значение некой
#переменной больше 0, выводилось бы специальное сообщение (используйте
#функцию print). Один раз выполните программу при значении переменной
#больше 0, второй раз — меньше 0.
#2. Усовершенствуйте предыдущий код с помощью ветки else так, чтобы в
#зависимости от значения переменной, выводилась либо 1, либо -1.
#3. Самостоятельно придумайте программу, в которой бы использовалась
#инструкция if (желательно с веткой else). Вложенный код должен содержать не
#менее трех выражений.

print ("Привет");
tovar1 = 50
tovar2 = 32
if tovar1+ tovar2 > 99 : print("Сумма не достаточна")
else: print("Чек оплачен")
print("Пока") 

print ("1 OR 2.______");
var_int = 0;
if var_int > 0: print('0')
#if var_int > 0: print('переменная > 0')
else : print('1')
#else : print('переменная < 0')
print ("__________");

print ("3.______");
var_float = 1;
var_int = 3;
if var_float + var_int >= 4 : print('сумма больше или равна 4')
else: print('сумма меньше 4')
	
print ("__________");
